app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
---
    def edit
        @student = Student.find(params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Anson"], ["last_name", "Nickel"], ["created_at", "2020-08-26 17:56:15.448833"], ["updated_at", "2020-08-26 17:56:15.448833"]]
---
    def create
        @student = Student.new(student_params)
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 64], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Vincent"], ["last_name", "Collis"], ["updated_at", "2020-08-27 04:10:47.715764"], ["id", 33]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)